---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.CurtainPanelsParamDefinedTypeDefinedCirculary
source: html/499c605c-a42e-6677-a182-7b0ccec005b8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.CurtainPanelsParamDefinedTypeDefinedCirculary Property

Parameter-defined type of curtain panels defined in a circular way and default panel type will be used instead.

## Syntax (C#)
```csharp
public static FailureDefinitionId CurtainPanelsParamDefinedTypeDefinedCirculary { get; }
```